In [1]:
import pandas as pd

In [2]:
s = pd.Series([1,2,3,4,5,6,'a'])
s

0    1
1    2
2    3
3    4
4    5
5    6
6    a
dtype: object

In [3]:
df = pd.DataFrame( {'user' : [1,2,3],
            'age' : [24,54,17],
            'sex' : ['F','F','M'],
            'occupation' : ['technician','musician','student']})

In [7]:
df.set_index('user', inplace=True)

In [8]:
df

      age sex  occupation
user
1      24   F  technician
2      54   F    musician
3      17   M     student

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 1 to 3
Data columns (total 3 columns):
age           3 non-null int64
sex           3 non-null object
occupation    3 non-null object
dtypes: int64(1), object(2)
memory usage: 96.0+ bytes

In [12]:
df.index

Int64Index([1, 2, 3], dtype='int64', name='user')

In [17]:
df.dtypes

age            int64
sex           object
occupation    object
dtype: object

In [18]:
df.describe()

             age
count   3.000000
mean   31.666667
std    19.655364
min    17.000000
25%    20.500000
50%    24.000000
75%    39.000000
max    54.000000

In [21]:
df.reset_index(inplace=True
              )

In [22]:
df

   user  age sex  occupation
0     1   24   F  technician
1     2   54   F    musician
2     3   17   M     student

In [25]:
df.set_index('age', inplace=True, append=True)

In [26]:
df

         sex  occupation
user age
1    24    F  technician
2    54    F    musician
3    17    M     student

In [29]:
df.reset_index()

   user  age sex  occupation
0     1   24   F  technician
1     2   54   F    musician
2     3   17   M     student

In [32]:
df = df.reset_index()
df

   user  age sex  occupation
0     1   24   F  technician
1     2   54   F    musician
2     3   17   M     student

In [34]:
df['age']

0    24
1    54
2    17
Name: age, dtype: int64